Source/CurrencyCloud.Tests/Mock/Http/Recordings/Accounts.json

[
  {
    "name": "SetUp",
    "requests": [
      {
        "request": {
          "method": "POST",
          "path": "/v2/authenticate/api",
          "headers": {
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          },
          "body": "?login_id=development@currencycloud.com&api_key=deadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeef"
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007469756093752"
          },
          "body": {
            "auth_token": "034d23d24490718e8766853e14d480b7"
          }
        }
      }
    ]
  },
  {
    "name": "TearDown",
    "requests": [
      {
        "request": {
          "method": "POST",
          "path": "/v2/authenticate/close_session",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
          }
        }
      }
    ]
  },
  {
    "name": "Create",
    "requests": [
      {
        "request": {
          "method": "POST",
          "path": "/v2/accounts/create",
          "body": "?account_name=Acme%20Ltd.&legal_entity_type=company&your_reference=POS-UID-23523&status=enabled&street=12%20Steward%20St&city=London&state_or_province=London&postal_code=E1%206FQ&country=GB&spread_table=no_markup&identification_type=none",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007469756093752"
          },
          "body": {
            "id": "9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
            "account_name": "Acme Ltd.",
            "brand": "currencycloud",
            "your_reference": "POS-UID-23523",
            "status": "enabled",
            "street": "12 Steward St",
            "city": "London",
            "state_or_province": "London",
            "country": "GB",
            "postal_code": "E1 6FQ",
            "spread_table": "no_markup",
            "legal_entity_type": "company",
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": "none",
            "identification_value": null,
            "short_reference": "151021-00021",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      },
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/current",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "id": "78618e58-da3c-447f-ad59-1796accfeff9",
            "account_name": "Toptal",
            "brand": "currencycloud",
            "your_reference": null,
            "status": "enabled",
            "street": null,
            "city": null,
            "state_or_province": null,
            "country": null,
            "postal_code": null,
            "spread_table": "fxcg_rfx_default",
            "legal_entity_type": null,
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": null,
            "identification_value": null,
            "short_reference": "151030-00006",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      }
    ]
  },
  {
    "name": "Get",
    "requests": [
      {
        "request": {
          "method": "POST",
          "path": "/v2/accounts/create",
          "body": "?account_name=Acme%20Ltd.&legal_entity_type=company&your_reference=POS-UID-23523&status=enabled&street=12%20Steward%20St&city=London&state_or_province=London&postal_code=E1%206FQ&country=GB&spread_table=no_markup&identification_type=none",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007469756093752"
          },
          "body": {
            "id": "9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
            "account_name": "Acme Ltd.",
            "brand": "currencycloud",
            "your_reference": "POS-UID-23523",
            "status": "enabled",
            "street": "12 Steward St",
            "city": "London",
            "state_or_province": "London",
            "country": "GB",
            "postal_code": "E1 6FQ",
            "spread_table": "no_markup",
            "legal_entity_type": "company",
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": "none",
            "identification_value": null,
            "short_reference": "151021-00021",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      },
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "id": "9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
            "account_name": "Acme Ltd.",
            "brand": "currencycloud",
            "your_reference": "POS-UID-23523",
            "status": "enabled",
            "street": "12 Steward St",
            "city": "London",
            "state_or_province": "London",
            "country": "GB",
            "postal_code": "E1 6FQ",
            "spread_table": "no_markup",
            "legal_entity_type": "company",
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": "none",
            "identification_value": null,
            "short_reference": "151021-00021",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      }
    ]
  },
  {
    "name": "Update",
    "requests": [
      {
        "request": {
          "method": "POST",
          "path": "/v2/accounts/create",
          "body": "?account_name=Acme%20Ltd.&legal_entity_type=company&your_reference=POS-UID-23523&status=enabled&street=12%20Steward%20St&city=London&state_or_province=London&postal_code=E1%206FQ&country=GB&spread_table=no_markup&identification_type=none",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007469756093752"
          },
          "body": {
            "id": "9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
            "account_name": "Acme Ltd.",
            "brand": "currencycloud",
            "your_reference": "POS-UID-23523",
            "status": "enabled",
            "street": "12 Steward St",
            "city": "London",
            "state_or_province": "London",
            "country": "GB",
            "postal_code": "E1 6FQ",
            "spread_table": "no_markup",
            "legal_entity_type": "company",
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": "none",
            "identification_value": null,
            "short_reference": "151021-00021",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      },
      {
        "request": {
          "method": "POST",
          "path": "/v2/accounts/9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
          "body": "?account_name=Company%20PLC&legal_entity_type=company&your_reference=0012345564ABC&status=enabled&street=12%20Steward%20St&city=London&state_or_province=&postal_code=E1%206FQ&country=GB&spread_table=flat_0.5_percent&identification_type=none",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007469756093752"
          },
          "body": {
            "id": "9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
            "account_name": "Company PLC",
            "brand": "currencycloud",
            "your_reference": "0012345564ABC",
            "status": "enabled",
            "street": "12 Steward St",
            "city": "London",
            "state_or_province": "",
            "country": "GB",
            "postal_code": "E1 6FQ",
            "spread_table": "flat_0.5_percent",
            "legal_entity_type": "company",
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": "none",
            "identification_value": null,
            "short_reference": "151021-00023",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      },
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "id": "9c9c2492-b0f3-4cfe-9243-b062c9985a9c",
            "account_name": "Company PLC",
            "brand": "currencycloud",
            "your_reference": "0012345564ABC",
            "status": "enabled",
            "street": "12 Steward St",
            "city": "London",
            "state_or_province": "",
            "country": "GB",
            "postal_code": "E1 6FQ",
            "spread_table": "flat_0.5_percent",
            "legal_entity_type": "company",
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": "none",
            "identification_value": null,
            "short_reference": "151021-00023",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      }
    ]
  },
  {
    "name": "FindWithParams",
    "requests": [
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/current",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "id": "78618e58-da3c-447f-ad59-1796accfeff9",
            "account_name": "Toptal",
            "brand": "currencycloud",
            "your_reference": null,
            "status": "enabled",
            "street": null,
            "city": null,
            "state_or_province": null,
            "country": null,
            "postal_code": null,
            "spread_table": "fxcg_rfx_default",
            "legal_entity_type": null,
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": null,
            "identification_value": null,
            "short_reference": "151030-00006",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      },
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/find",
          "query": "?account_name=Toptal&order=created_at&order_asc_desc=desc&per_page=5",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "accounts": [
              {
                "id": "78618e58-da3c-447f-ad59-1796accfeff9",
                "account_name": "Toptal",
                "brand": "currencycloud",
                "your_reference": null,
                "status": "enabled",
                "street": null,
                "city": null,
                "state_or_province": null,
                "country": null,
                "postal_code": null,
                "spread_table": "fxcg_rfx_default",
                "legal_entity_type": null,
                "created_at": "2018-01-01T12:34:56+00:00",
                "updated_at": "2018-01-01T12:34:56+00:00",
                "identification_type": null,
                "identification_value": null,
                "short_reference": "151030-00006",
                "api_trading": true,
                "online_trading": true,
                "phone_trading": true,
                "process_third_party_funds": true,
                "settlement_type": "net"
              }
            ],
            "pagination": {
              "total_entries": 1,
              "total_pages": 1,
              "current_page": 1,
              "per_page": 5,
              "previous_page": -1,
              "next_page": -1,
              "order": "created_at",
              "order_asc_desc": "desc"
            }
          }
        }
      }
    ]
  },
  {
    "name": "FindNoParams",
    "requests": [
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/current",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "id": "78618e58-da3c-447f-ad59-1796accfeff9",
            "account_name": "Toptal",
            "brand": "currencycloud",
            "your_reference": null,
            "status": "enabled",
            "street": null,
            "city": null,
            "state_or_province": null,
            "country": null,
            "postal_code": null,
            "spread_table": "fxcg_rfx_default",
            "legal_entity_type": null,
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": null,
            "identification_value": null,
            "short_reference": "151030-00006",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      },
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/find",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "accounts": [
              {
                "id": "78618e58-da3c-447f-ad59-1796accfeff9",
                "account_name": "Toptal",
                "brand": "currencycloud",
                "your_reference": null,
                "status": "enabled",
                "street": null,
                "city": null,
                "state_or_province": null,
                "country": null,
                "postal_code": null,
                "spread_table": "fxcg_rfx_default",
                "legal_entity_type": null,
                "created_at": "2018-01-01T12:34:56+00:00",
                "updated_at": "2018-01-01T12:34:56+00:00",
                "identification_type": null,
                "identification_value": null,
                "short_reference": "151030-00006",
                "api_trading": true,
                "online_trading": true,
                "phone_trading": true,
                "process_third_party_funds": true,
                "settlement_type": "net"
              }
            ],
            "pagination": {
              "total_entries": 1,
              "total_pages": 1,
              "current_page": 1,
              "per_page": 5,
              "previous_page": -1,
              "next_page": -1,
              "order": "created_at",
              "order_asc_desc": "desc"
            }
          }
        }
      }
    ]
  },
  {
    "name": "GetCurrent",
    "requests": [
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/current",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "id": "78618e58-da3c-447f-ad59-1796accfeff9",
            "account_name": "Toptal",
            "brand": "currencycloud",
            "your_reference": null,
            "status": "enabled",
            "street": null,
            "city": null,
            "state_or_province": null,
            "country": null,
            "postal_code": null,
            "spread_table": "fxcg_rfx_default",
            "legal_entity_type": null,
            "created_at": "2018-01-01T12:34:56+00:00",
            "updated_at": "2018-01-01T12:34:56+00:00",
            "identification_type": null,
            "identification_value": null,
            "short_reference": "151030-00006",
            "api_trading": true,
            "online_trading": true,
            "phone_trading": true,
            "process_third_party_funds": true,
            "settlement_type": "net"
          }
        }
      }
    ]
  },
  {
    "name": "GetChargesSettings",
    "requests": [
      {
        "request": {
          "method": "GET",
          "path": "/v2/accounts/e277c9f9-679f-454f-8367-274b3ff977ff/payment_charges_settings",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "payment_charges_settings": [
              {
                "charge_settings_id": "18f3f814-fef0-4211-a028-fe22c4b69818",
                "account_id": "e277c9f9-679f-454f-8367-274b3ff977ff",
                "charge_type": "ours",
                "enabled": false,
                "default": false
              },
              {
                "charge_settings_id": "734bd817-0ab0-49ae-9e96-1f623a809f11",
                "account_id": "e277c9f9-679f-454f-8367-274b3ff977ff",
                "charge_type": "shared",
                "enabled": true,
                "default": true
              }
            ]
          }
        }
      }
    ]
  },
  {
    "name": "ManageChargesSettings",
    "requests": [
      {
        "request": {
          "method": "POST",
          "path": "/v2/accounts/e277c9f9-679f-454f-8367-274b3ff977ff/payment_charges_settings/18f3f814-fef0-4211-a028-fe22c4b69818",
          "body": "?enabled=true&default=true",
          "headers": {
            "X-Auth-Token": "034d23d24490718e8766853e14d480b7",
            "User-Agent": "CurrencyCloudSDK/2.0 .NET/5.7.1"
          }
        },
        "response": {
          "status": 200,
          "headers": {
            "Date": "Mon, 01 Jan 2018 12:34:56 GMT",
            "Content-Type": "application/json;charset=utf-8",
            "X-Request-Id": "2910007472633409851"
          },
          "body": {
            "charge_settings_id": "18f3f814-fef0-4211-a028-fe22c4b69818",
            "account_id": "e277c9f9-679f-454f-8367-274b3ff977ff",
            "charge_type": "shared",
            "enabled": true,
            "default": true
          }
        }
      }
    ]
  }
]
